new WOW().init();

//==============================================================================================================
//jsp+온로드 이벤트
//==============================================================================================================
window.onload = function () {

//가격표시
	$("#productPrice").text( numberFormat($("#productPrice").text()) );
	$("#totalPrice").text( numberFormat($("#totalPrice").text()) );
	$("#paymentPrice").text( numberFormat($("#paymentPrice").text()) );
	$("#usePoint").text( numberFormat2($("#usePoint").text()) );
	$("#addPoint").text( numberFormat2($("#addPoint").text()) );


}//window_onload)
//==============================================================================================================


//==============================================================================================================
// 통화표시 & 포인트표시
//==============================================================================================================
function numberFormat(inputNumber) {
  return inputNumber.toString().replace(/\B(?=(\d{3})+(?!\d))/g, ",")+"원";
}

function numberFormat2(inputNumber) {
  return inputNumber.toString().replace(/\B(?=(\d{3})+(?!\d))/g, ",")+"P";
}
//==============================================================================================================